Revit 2027 API
JoinGeometryUtils.GetJoinedElements Method
 Returns all elements joined to given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetJoinedElements(
	Document document,
	Element element
)
Public Shared Function GetJoinedElements (
	document As Document,
	element As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetJoinedElements(
	Document^ document,
	Element^ element
)
static member GetJoinedElements :
        document : Document *
        element : Element -> ICollection<ElementId>
Parameters
document Document
 The document containing the element.
element Element
 The element.
Return Value
ICollection<ElementId>
 The set of elements that are joined to the given element.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element element was not found in the given document.
ArgumentNullException |  A non-optional argument was null
Remarks
 This functionality is not available for family documents.
See Also
Reference
JoinGeometryUtils Class
Autodesk.Revit.DB Namespace